Merge branch 'doc/documentation_and_workflow' into dev
